cats99/app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params)
        if @cat.save!
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @cat = Cat.find_by(id: params[:id])
        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "Orange"], ["description", "little littler kitty"], ["updated_at", "2022-04-01 23:46:49.597545"], ["id", 3]]